//=============================================================================
// Drill_SimpleCourseC1.js
//=============================================================================

/*:
 * @plugindesc [v1.0]        脚本教学 - 课程c1
 * @author Drill_up
 *
 * @help
 * =============================================================================
 * +++ Drill_SimpleCourseC1 +++
 * 作者：Drill_up
 * =============================================================================
 * 课程：在地图界面中放一个贴图。
 * 
 * 
 * -----------------------------------------------------------------------------
 * ----更新日志
 * [v1.0]
 * 完成插件ヽ(*。>Д<)o゜
 * 
 */
 
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
//		插件简称		SCC1（Simple_Course_C）
//		临时全局变量	无
//		临时局部变量	无
//		存储数据变量	无
//		全局存储变量	无
//		覆盖重写方法	无
//
//插件记录：
//		★大体框架与功能如下：
//			课程c1：
//				->资源文件夹脚本
//				->插件指令脚本
//				->贴图创建脚本
//				->地图界面结构
//
//		★必要注意事项：
//			1.这节课学完了就不要跑去自己写插件了，还有很多坑没讲，不要急。
//
//		★其它说明细节：
//			暂无
//			

//=============================================================================
// ** 变量获取
//=============================================================================
	var Imported = Imported || {};					//导入识别类
	Imported.Drill_SimpleCourseC1 = true;			//导入的插件标记
	var DrillUp = DrillUp || {}; 											//临时全局变量中转类
	DrillUp.parameters = PluginManager.parameters('Drill_SimpleCourseC1');	//读取插件管理器中的数据
	
	
//=============================================================================
// ** 资源文件夹
//=============================================================================

//  >> 资源文件夹部分
// （在这部分写课程的脚本内容）


//=============================================================================
// * 插件指令
//=============================================================================
var _drill_SCC1_pluginCommand = Game_Interpreter.prototype.pluginCommand;
Game_Interpreter.prototype.pluginCommand = function(command, args) {
	_drill_SCC1_pluginCommand.call(this, command, args);
	
	//  >> 插件指令部分
	// （在这部分写课程的脚本内容）
	
};


//=============================================================================
// ** 地图界面
//=============================================================================

//  >> 贴图创建部分
// （在这部分写课程的脚本内容）
	
	

