//=============================================================================
// Drill_SimpleCourseD3.js
//=============================================================================

/*:
 * @plugindesc [v1.0]        脚本教学 - 课程d3
 * @author Drill_up
 *
 * @help
 * =============================================================================
 * +++ Drill_SimpleCourseD3 +++
 * 作者：Drill_up
 * =============================================================================
 * 课程：在地图界面中放一个贴图。
 * 
 * 
 *   >> 代码 - 资源文件参数部分
 * （在这部分写课程提供的脚本内容）
 * 
 * 
 * -----------------------------------------------------------------------------
 * ----更新日志
 * [v1.0]
 * 完成插件ヽ(*。>Д<)o゜
 * 
 */
 
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
//		插件简称		SCD3（Simple_Course_D）
//		临时全局变量	无
//		临时局部变量	无
//		存储数据变量	无
//		全局存储变量	无
//		覆盖重写方法	无
//
//插件记录：
//		★大体框架与功能如下：
//			课程d3：
//				->贴图创建脚本
//				->GIF播放
//				->菜单界面结构
//					->离开界面功能
//
//		★必要注意事项：
//			1.这节课学完了就不要跑去自己写插件了，还有很多坑没讲，不要急。
//
//		★其它说明细节：
//			暂无
//			

//=============================================================================
// ** 变量获取
//=============================================================================
	var Imported = Imported || {};					//导入识别类
	Imported.Drill_SimpleCourseD3 = true;			//导入的插件标记
	var DrillUp = DrillUp || {}; 											//临时全局变量中转类
	DrillUp.parameters = PluginManager.parameters('Drill_SimpleCourseD3');	//读取插件管理器中的数据
	
	
	//  >> 变量获取部分
	// （在这部分写课程的脚本内容）
	
	
//=============================================================================
// ** 资源文件夹
//=============================================================================
ImageManager.load_CourseD = function(filename) {
	return this.loadBitmap('img/Course__D/', filename, 0, true);     
};


//=============================================================================
// * 插件指令
//=============================================================================
var _drill_SCD3_pluginCommand = Game_Interpreter.prototype.pluginCommand;
Game_Interpreter.prototype.pluginCommand = function(command, args) {
	_drill_SCD3_pluginCommand.call(this, command, args);
	
	//  >> 插件指令部分
	// （在这部分写课程的脚本内容）
	
};


//=============================================================================
// ** 菜单界面
//=============================================================================

//  >> 界面定义部分
// （在这部分写课程的脚本内容）



//==============================
// * 面板 - 创建
//==============================

//  >> 界面创建部分
// （在这部分写课程的脚本内容）

	

//==============================
// * 面板 - 帧刷新
//==============================

//  >> 界面帧刷新部分
// （在这部分写课程的脚本内容）
	
	

	
	

